In [1]:
import numpy as np
import pandas as pd

C:\Users\Aanand\AppData\Local\Temp\ipykernel_1736\1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
dict1 = {
    "name" : ['Aanand', 'Ayush', 'Raushan', 'Harsh'],
    "city" : ['Patna', 'Hajipur', 'Sonpur', 'Rampur'],
    "marks" : [95, 98, 99, 96],
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name     city  marks
0   Aanand    Patna     95
1    Ayush  Hajipur     98
2  Raushan   Sonpur     99
3    Harsh   Rampur     96

In [8]:
df.to_csv('03_Panda.csv')

In [ ]:
df.to_csv('03_Panda.csv', index=False)   # this removes index

In [9]:
df.head(2)

     name     city  marks
0  Aanand    Patna     95
1   Ayush  Hajipur     98

In [10]:
df.tail(2)

      name    city  marks
2  Raushan  Sonpur     99
3    Harsh  Rampur     96

In [11]:
df.describe()

           marks
count   4.000000
mean   97.000000
std     1.825742
min    95.000000
25%    95.750000
50%    97.000000
75%    98.250000
max    99.000000

In [12]:
data = pd.read_csv('Iris.csv')

In [13]:
data

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [14]:
data['SepalWidthCm']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: SepalWidthCm, Length: 150, dtype: float64

In [17]:
data['SepalWidthCm'][4]

3.6

In [18]:
data['SepalWidthCm'][0] = 10  # For changing the data values

C:\Users\Aanand\AppData\Local\Temp\ipykernel_1736\2082076678.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['SepalWidthCm'][0] = 10  # For changing the data values

In [19]:
data['SepalWidthCm'][0]

10.0

In [20]:
data

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,10.0,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [21]:
df.index = ['a','b','c','d']

In [22]:
df

      name     city  marks
a   Aanand    Patna     95
b    Ayush  Hajipur     98
c  Raushan   Sonpur     99
d    Harsh   Rampur     96

In [25]:
ser = pd.Series(np.random.rand(10))

In [26]:
ser

0    0.844738
1    0.353813
2    0.395730
3    0.579623
4    0.185999
5    0.384944
6    0.877636
7    0.503012
8    0.895544
9    0.280596
dtype: float64

In [27]:
type(ser)

pandas.core.series.Series

In [28]:
new_df = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [30]:
new_df.head()

          0         1         2         3         4
0  0.696731  0.995077  0.496945  0.887219  0.792552
1  0.389019  0.118237  0.684888  0.182675  0.636740
2  0.587003  0.849874  0.133520  0.132613  0.457613
3  0.194159  0.165623  0.245650  0.563061  0.883451
4  0.300254  0.499326  0.458696  0.401514  0.381755

In [31]:
type(new_df)

pandas.core.frame.DataFrame

In [32]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.502608    0.468790    0.494362    0.508986    0.509836
std      0.288773    0.294237    0.279451    0.286946    0.287871
min      0.005916    0.001127    0.000344    0.001996    0.004318
25%      0.249607    0.208450    0.250549    0.260737    0.260763
50%      0.492233    0.451580    0.490420    0.529407    0.510446
75%      0.737629    0.750071    0.706813    0.751806    0.745300
max      0.999927    0.995077    0.990635    0.999681    0.996045

In [33]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
new_df[0][0] = "Aanand"

C:\Users\Aanand\AppData\Local\Temp\ipykernel_1736\4038194709.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df[0][0] = "Aanand"
C:\Users\Aanand\AppData\Local\Temp\ipykernel_1736\4038194709.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Aanand' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_df[0][0] = "Aanand"

In [35]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [36]:
new_df.head()

          0         1         2         3         4
0    Aanand  0.995077  0.496945  0.887219  0.792552
1  0.389019  0.118237  0.684888  0.182675  0.636740
2  0.587003  0.849874  0.133520  0.132613  0.457613
3  0.194159  0.165623  0.245650  0.563061  0.883451
4  0.300254  0.499326  0.458696  0.401514  0.381755

In [37]:
new_df.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [38]:
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [39]:
new_df.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0      Aanand  0.995077  0.496945  0.887219  0.792552
1    0.389019  0.118237  0.684888  0.182675  0.636740
2    0.587003  0.849874  0.133520  0.132613  0.457613
3    0.194159  0.165623  0.245650  0.563061  0.883451
4    0.300254  0.499326  0.458696  0.401514  0.381755
..        ...       ...       ...       ...       ...
329   0.12031  0.536892  0.488950  0.309568  0.181297
330  0.540508  0.597103  0.707146  0.346842  0.065919
331  0.789874  0.238194  0.388124  0.100604  0.792916
332  0.284633  0.591256  0.675875  0.023740  0.219017
333   0.28289  0.877943  0.974095  0.692164  0.136531

[334 rows x 5 columns]>

In [40]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Aanand,0.389019,0.587003,0.194159,0.300254,0.540016,0.403268,0.834351,0.865717,0.298208,...,0.099716,0.561487,0.534186,0.312295,0.11095,0.12031,0.540508,0.789874,0.284633,0.28289
1,0.995077,0.118237,0.849874,0.165623,0.499326,0.414087,0.215946,0.181451,0.203751,0.74547,...,0.246229,0.30605,0.012901,0.716378,0.623946,0.536892,0.597103,0.238194,0.591256,0.877943
2,0.496945,0.684888,0.13352,0.24565,0.458696,0.809117,0.139822,0.144078,0.907711,0.669517,...,0.408105,0.025185,0.598028,0.215939,0.049431,0.48895,0.707146,0.388124,0.675875,0.974095
3,0.887219,0.182675,0.132613,0.563061,0.401514,0.559305,0.409927,0.824477,0.866479,0.966261,...,0.502583,0.674445,0.299781,0.301018,0.173142,0.309568,0.346842,0.100604,0.02374,0.692164
4,0.792552,0.63674,0.457613,0.883451,0.381755,0.738833,0.519281,0.573667,0.460086,0.424613,...,0.229837,0.761886,0.513126,0.086434,0.904265,0.181297,0.065919,0.792916,0.219017,0.136531

In [41]:
new_df.sort_index(axis=0, ascending = False)

            0         1         2         3         4
333   0.28289  0.877943  0.974095  0.692164  0.136531
332  0.284633  0.591256  0.675875  0.023740  0.219017
331  0.789874  0.238194  0.388124  0.100604  0.792916
330  0.540508  0.597103  0.707146  0.346842  0.065919
329   0.12031  0.536892  0.488950  0.309568  0.181297
..        ...       ...       ...       ...       ...
4    0.300254  0.499326  0.458696  0.401514  0.381755
3    0.194159  0.165623  0.245650  0.563061  0.883451
2    0.587003  0.849874  0.133520  0.132613  0.457613
1    0.389019  0.118237  0.684888  0.182675  0.636740
0      Aanand  0.995077  0.496945  0.887219  0.792552

[334 rows x 5 columns]

In [42]:
new_df.sort_index(axis=1, ascending = False)

            4         3         2         1         0
0    0.792552  0.887219  0.496945  0.995077    Aanand
1    0.636740  0.182675  0.684888  0.118237  0.389019
2    0.457613  0.132613  0.133520  0.849874  0.587003
3    0.883451  0.563061  0.245650  0.165623  0.194159
4    0.381755  0.401514  0.458696  0.499326  0.300254
..        ...       ...       ...       ...       ...
329  0.181297  0.309568  0.488950  0.536892   0.12031
330  0.065919  0.346842  0.707146  0.597103  0.540508
331  0.792916  0.100604  0.388124  0.238194  0.789874
332  0.219017  0.023740  0.675875  0.591256  0.284633
333  0.136531  0.692164  0.974095  0.877943   0.28289

[334 rows x 5 columns]

In [43]:
new_df[0]

0        Aanand
1      0.389019
2      0.587003
3      0.194159
4      0.300254
         ...
329     0.12031
330    0.540508
331    0.789874
332    0.284633
333     0.28289
Name: 0, Length: 334, dtype: object

In [44]:
type(new_df[0])

pandas.core.series.Series

In [45]:
new_df2 = new_df     # new_df2 will creates a view of new_df

In [46]:
new_df

            0         1         2         3         4
0      Aanand  0.995077  0.496945  0.887219  0.792552
1    0.389019  0.118237  0.684888  0.182675  0.636740
2    0.587003  0.849874  0.133520  0.132613  0.457613
3    0.194159  0.165623  0.245650  0.563061  0.883451
4    0.300254  0.499326  0.458696  0.401514  0.381755
..        ...       ...       ...       ...       ...
329   0.12031  0.536892  0.488950  0.309568  0.181297
330  0.540508  0.597103  0.707146  0.346842  0.065919
331  0.789874  0.238194  0.388124  0.100604  0.792916
332  0.284633  0.591256  0.675875  0.023740  0.219017
333   0.28289  0.877943  0.974095  0.692164  0.136531

[334 rows x 5 columns]

In [47]:
new_df2[0][0] = 1235    # at index 0,0 -> values will changes in both data frame

In [48]:
new_df

            0         1         2         3         4
0        1235  0.995077  0.496945  0.887219  0.792552
1    0.389019  0.118237  0.684888  0.182675  0.636740
2    0.587003  0.849874  0.133520  0.132613  0.457613
3    0.194159  0.165623  0.245650  0.563061  0.883451
4    0.300254  0.499326  0.458696  0.401514  0.381755
..        ...       ...       ...       ...       ...
329   0.12031  0.536892  0.488950  0.309568  0.181297
330  0.540508  0.597103  0.707146  0.346842  0.065919
331  0.789874  0.238194  0.388124  0.100604  0.792916
332  0.284633  0.591256  0.675875  0.023740  0.219017
333   0.28289  0.877943  0.974095  0.692164  0.136531

[334 rows x 5 columns]

In [50]:
new_df3 = new_df.copy()     # new_df2 is now copy of new_df

In [51]:
new_df3[0][0] = 123       # at index 0,0 -> values will change in only new_df3

C:\Users\Aanand\AppData\Local\Temp\ipykernel_1736\1204303259.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df3[0][0] = 123
C:\Users\Aanand\AppData\Local\Temp\ipykernel_1736\1204303259.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df3[0][0] = 123

In [59]:
new_df.head(2)

          0         1         2         3         4
0       888  0.995077  0.496945  0.887219  0.792552
1  0.389019  0.118237  0.684888  0.182675  0.636740

In [58]:
new_df3.head(2)

          0         1         2         3         4
0       123  0.995077  0.496945  0.887219  0.792552
1  0.389019  0.118237  0.684888  0.182675  0.636740

In [55]:
new_df.loc[0,0] = 888        # use always loc function for changing any values at any index

In [57]:
new_df.head(2)

          0         1         2         3         4
0       888  0.995077  0.496945  0.887219  0.792552
1  0.389019  0.118237  0.684888  0.182675  0.636740

In [64]:
new_df.drop(4, axis=1)    # for deletion

            0         1         2         3
0         888  0.995077  0.496945  0.887219
1    0.389019  0.118237  0.684888  0.182675
2    0.587003  0.849874  0.133520  0.132613
3    0.194159  0.165623  0.245650  0.563061
4    0.300254  0.499326  0.458696  0.401514
..        ...       ...       ...       ...
329   0.12031  0.536892  0.488950  0.309568
330  0.540508  0.597103  0.707146  0.346842
331  0.789874  0.238194  0.388124  0.100604
332  0.284633  0.591256  0.675875  0.023740
333   0.28289  0.877943  0.974095  0.692164

[334 rows x 4 columns]

In [65]:
new_df.drop(3, axis=0)    # for deletion

            0         1         2         3         4
0         888  0.995077  0.496945  0.887219  0.792552
1    0.389019  0.118237  0.684888  0.182675  0.636740
2    0.587003  0.849874  0.133520  0.132613  0.457613
4    0.300254  0.499326  0.458696  0.401514  0.381755
5    0.540016  0.414087  0.809117  0.559305  0.738833
..        ...       ...       ...       ...       ...
329   0.12031  0.536892  0.488950  0.309568  0.181297
330  0.540508  0.597103  0.707146  0.346842  0.065919
331  0.789874  0.238194  0.388124  0.100604  0.792916
332  0.284633  0.591256  0.675875  0.023740  0.219017
333   0.28289  0.877943  0.974095  0.692164  0.136531

[333 rows x 5 columns]

In [66]:
new_df.loc[[1,2], [2,4]]

          2         4
1  0.684888  0.636740
2  0.133520  0.457613

In [68]:
new_df.loc[:, [2,4]]

            2         4
0    0.496945  0.792552
1    0.684888  0.636740
2    0.133520  0.457613
3    0.245650  0.883451
4    0.458696  0.381755
..        ...       ...
329  0.488950  0.181297
330  0.707146  0.065919
331  0.388124  0.792916
332  0.675875  0.219017
333  0.974095  0.136531

[334 rows x 2 columns]

In [69]:
new_df.loc[[1,2], :]

          0         1         2         3         4
1  0.389019  0.118237  0.684888  0.182675  0.636740
2  0.587003  0.849874  0.133520  0.132613  0.457613

In [73]:
new_df.loc[(new_df[0]<0.3) & (new_df[3]>0.4)]

            0         1         2         3         4
3    0.194159  0.165623  0.245650  0.563061  0.883451
9    0.298208  0.745470  0.669517  0.966261  0.424613
12   0.136467  0.746108  0.155292  0.694606  0.080750
16   0.152207  0.423526  0.452231  0.524278  0.005062
23   0.217919  0.524135  0.527034  0.992941  0.215357
37   0.065546  0.806056  0.746018  0.624616  0.049145
45   0.011566  0.275900  0.073856  0.933104  0.816061
49   0.023354  0.154095  0.834918  0.882303  0.296345
64   0.254334  0.123411  0.374477  0.694518  0.672186
77   0.053754  0.213736  0.361802  0.668572  0.232301
85    0.24581  0.741953  0.222054  0.660248  0.439742
93   0.092432  0.153126  0.392287  0.610655  0.626094
104  0.120069  0.043155  0.313578  0.450082  0.371427
122  0.183203  0.129917  0.500426  0.561186  0.197935
123  0.260305  0.225359  0.537320  0.976002  0.602914
127  0.146473  0.901373  0.587339  0.817789  0.243446
133  0.182776  0.142925  0.376020  0.541708  0.687937
139   0.22785  0.049654  0.968624  0.671783  0.280813
142  0.265207  0.605468  0.941711  0.638154  0.178265
143  0.040337  0.688528  0.905285  0.423988  0.775610
148  0.145495  0.548801  0.118390  0.871110  0.693733
150  0.195457  0.790941  0.266663  0.777161  0.688926
151  0.146804  0.909646  0.384889  0.999681  0.412715
152  0.058728  0.873737  0.378822  0.460195  0.894332
174  0.122659  0.541716  0.320651  0.730434  0.167446
181  0.169604  0.305422  0.490969  0.444913  0.914937
185  0.225712  0.911040  0.515719  0.942036  0.924221
186   0.25843  0.276386  0.452223  0.626193  0.546879
188  0.034521  0.163054  0.466824  0.550617  0.566053
191  0.201176  0.059091  0.916455  0.534904  0.817671
197  0.025171  0.799919  0.705814  0.529490  0.494723
205  0.005916  0.920160  0.419679  0.492969  0.028573
207  0.105878  0.308623  0.161953  0.948071  0.770270
213  0.240001  0.804380  0.654694  0.561142  0.422812
217  0.287858  0.268522  0.529577  0.835059  0.145450
221  0.248357  0.100633  0.416247  0.720865  0.118981
224  0.058386  0.868783  0.083092  0.864002  0.219848
235  0.047841  0.974086  0.411630  0.707857  0.978107
245  0.115843  0.862748  0.168748  0.863398  0.597532
247  0.089241  0.823498  0.326241  0.948074  0.742734
249  0.101708  0.353554  0.132077  0.650614  0.715665
264  0.022603  0.678255  0.197221  0.745347  0.252697
265  0.161233  0.685447  0.643503  0.877737  0.972145
266  0.009774  0.250312  0.242474  0.911782  0.268030
281  0.020096  0.331465  0.430343  0.602910  0.004318
284  0.027305  0.691525  0.162984  0.579875  0.776719
293  0.127387  0.246103  0.339409  0.599016  0.797560
295  0.216034  0.532392  0.789751  0.685270  0.969460
296  0.220421  0.691177  0.784856  0.493060  0.030446
309  0.179486  0.162610  0.561263  0.966005  0.568509
313  0.179628  0.865599  0.940103  0.546442  0.130329
318  0.021864  0.819029  0.377842  0.752256  0.933709
324  0.099716  0.246229  0.408105  0.502583  0.229837
333   0.28289  0.877943  0.974095  0.692164  0.136531

In [74]:
new_df.head(2)

          0         1         2         3         4
0       888  0.995077  0.496945  0.887219  0.792552
1  0.389019  0.118237  0.684888  0.182675  0.636740

In [76]:
new_df.iloc[0,3]

0.8872192739717967

In [1]:
new_df.iloc[0,4]

NameError: name 'new_df' is not defined